app/Controllers/LoginController.php

    public function criarConta()
>>>>>>> 51c37fe912e8f9ea43f407f114379b7b6eb5cd01
    {
        // Salvar os dados do usuário no banco de dados
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $userModel = new UserModel();
        $userModel->insert([
            'username' => $username,
            'password' => password_hash($password, PASSWORD_DEFAULT)
        ]);
---
INSERT INTO `users` (`username`, `password`) VALUES ('kkkkk', '$2y$10$YEDYP0arbGg4.8Cs7RV58u1TmbOfxo3hqj1tTQYVERFjNtDR9tKma')