app/Controllers/RecrutamentoController.php

SELECT *
FROM `vagas`
SELECT COUNT(*) AS `numrows`
FROM `vagas`
WHERE `status` = 'Aberta'
---
    public function pagina2()
    {
        $data['vagas'] = $this->vagaModel->findAll();
        $data['numero_vagas'] = $this->vagaModel->where('status', 'Aberta')->countAllResults();